#include<stdio.h>
int  main(void)
{
 int i;
 double x,avg=0.0,navg,sum=0.0;
 printf("%5s%17s%17s%17s\n%5s%17s%17s%17s\n\n","Count","Item","Average","Naive avg","-----","----","-------","---------");
 for(i=1;scanf("%lf",&x)==1;++i)
 {
     avg+=(x-avg)/i;//何用C语言求一个数组的平均数？

//1.按照小学的数学知识，平均数=所有数的和 / 数的个数

//但是如果求一个数组x[999999999]其元素均为99999999，即x[i]=999999对0<= i <=999999999都成立，这时怎么办？计算机根本没有这么一个数据类型可以存放这么大的sum。

//那么有这么一种思想：前一步的结果作为后一步的运算因子，可以大大节省运算量和存储量。

//1和2的平均数就是将1+2=3平分给两个位置（[1.5]  [1.5]），1，2，4的平均数就是将1+2+4=7平//分给三个位置，那么可以先将3放到位置中（[1.5]   [1.5]   [1.5]+2.5 ），再将剩下的2.5除以3,平分到三个位置中。

//于是算法就出来了

avg=0, avg+=(x-avg)/i;
     sum+=x;
     navg=sum/i;
     printf("%5d%17e%17e%17e\n",i,x,avg,navg);
 }
 return 0;
}

